backend/src/ws/test/load-test.yaml
config:
  target: "http://localhost:3000" 
  processor: "./dynamicBid.cjs" 
  
  payload:
    path: "mock-users.csv"
    fields:
      - "id"
      - "token"
    order: sequence 
  
  engines:
    socketio-v3: {}

  phases:
  - duration:   133  # 200/1.5
    arrivalRate: 75  # 75 users/sec × 133s = 10,000
    name: "Ramp up"
  - pause: 60
    name: "Hold under load"


scenarios:
  - name: "Random Interval Bidding"
    engine: socketio-v3
    flow:
      - connect:
          transports: ["websocket"]
          auth:
            token: "{{ token }}"
      - emit:
        - "joinAuction"
        - auctionId: "69bb29f9763cc9b83c810541" 
      
      - think: 1
      
      - loop:
          - function: "generateBid" 
          - emit:
            - "placeBid"
            - auctionId: "69bb29f9763cc9b83c810541"
              amount: "{{ dynamicBid }}" # Use the dynamic bid amount here
          
          - think: 1
        count: 60