backend/src/ws/test/load-test.yaml
config:
  target: "http://localhost:3000" 
  processor: "./dynamicBid.cjs" 
  
  payload:
    path: "mock-users.csv"
    fields:
      - "id"
      - "token"
    order: sequence 
  
  engines:
    socketio-v3: {}

  phases:
  - duration: 200    # ~3.5 minutes
    arrivalRate: 50  # 50 users/sec × 200s = 10,000
    name: "Ramp up"
  - pause: 60
    name: "Hold under load"


scenarios:
  - name: "Random Interval Bidding"
    engine: socketio-v3
    flow:
      - connect:
          transports: ["websocket"]
          auth:
            token: "{{ token }}"
      - emit:
        - "joinAuction"
        - auctionId: "69b9c0cd8afa40228266554c" 
      
      - think: 1
      
      - loop:
          - function: "generateBid" 
          - emit:
            - "placeBid"
            - auctionId: "69b9c0cd8afa40228266554c"
              amount: "{{ dynamicBid }}" # Use the dynamic bid amount here
          
          - think: 5
        count: 12